<template><div><h1 id="网络设备" tabindex="-1"><a class="header-anchor" href="#网络设备" aria-hidden="true">#</a> 网络设备</h1>
<h2 id="网关" tabindex="-1"><a class="header-anchor" href="#网关" aria-hidden="true">#</a> 网关</h2>
<p>网关是一个大概念，不具体特指一类产品，只要连接两个不同的网络的设备都可以叫网关；而‘路由器’么一般特指能够实现路由寻找和转发的特定类产品，路由器很显然能够实现网关的功能。换句话说，路由器可以实现网关的功能，但是路由器功能不仅仅是实现网关；网关可以由路由器实现，但是也不仅仅是由路由器实现。与网桥只是简单地传达信息不同，当信息到达网关以后，网关要对信息重新进行加工，以适应目的系统的需求。</p>
<h2 id="网桥、交换机" tabindex="-1"><a class="header-anchor" href="#网桥、交换机" aria-hidden="true">#</a> 网桥、交换机</h2>
<p>网桥又称桥接器，英文名Network Bridge，数据链路层设备。网桥却能看懂一些帧的信息。在以太网构造的局域网上，最终的寻址是以数据链路层的MAC地址作为标识的(就是用MAC地址可以在局域网上找到一台唯一的机器)，网桥能从发来的数据包中提取MAC信息，并且根据MAC信息对数据包进行有目的的转发，而不采用广播的方式，这样就能减少广播风暴的出现，提升整个网络的效率。但是它一般只有<strong>两个输入\出口</strong>，要配合集线器使用，减少集线器(HUB)广播的数量来减少网络风暴的。后来随着硬件发展，出现了好多端口的链路层设备，这就是交换机，<strong>个人认为网桥已经被交换机替代了。</strong>(无线网桥除外)</p>
<h2 id="网桥不能连接不同网段" tabindex="-1"><a class="header-anchor" href="#网桥不能连接不同网段" aria-hidden="true">#</a> 网桥不能连接不同网段</h2>
<p><strong>网桥不能连接不同网段</strong>,不同网段之间通信，需要网关的帮助，它一般是路由器这类网络层的设备。网桥或交换机是链路层设备，网段这个是和IP相关的概念，属于网络层。网桥和交换机跟本无能力去处理网络层的东西！如果非要说用网桥和交换机去连接两个不同网段的网络不是不行，只是没有作用而已，因为不同网段机器的始终是不能互访问</p>
</div></template>


